
[




    
    {
        "title": "The Story of this Website #2",
        "content": "Hello, you are now reading the second episode for “The Story of this Website”.\n\nSo, you might notice it, this blog completely has a brand new design. And it’s now powered by Polymer, which is new web development based on custom web components and it’s currently developing by Google.\n\nPolymer\nIt’s beautiful and responsive support. Now the web page will fit the browser automatically, even in mobile and tablet. Of course, this blog still a Jekyll blog.\n\nBUT if are NOT using Google Chrome, you might face some weird problems while browsing this blog. Don’t worry, this is the disadvantage of Polymer. Since Polymer is still beta, it’s normal. The easiest way is to install Google Chrome and uninstall Internet Explorer. Er, why you still using IE ye?\n\nHTTPS\nSecurity, security, security and security. We want a safe browsing experience for sure. So, I decided to ‘upgrade’ my blog from the default HTTP to the more secure HTTP, which is HTTPS (HTTP Secure) Obviously, it’s more secure than HTTP, that’s mean no more data leaks when you are browsing this blog (and homepage too) in public WiFi.\n\nFOR DEVELOPER: Maybe you might ask me, is that free to get this SSL? The answer is YES! I get this SSL for completely free, no even single cent. How? I get this from Cloudflare. Again, for FREE. More info, you are welcome to visit Cloudflare website: Cloudflare.com.\n\nNew Feature: Search\nSearch. Now you can search the content in this blog. The search is accessible from the drawer panel which is at the left-hand site of the website or through this URL: blog.limhenry.me/search\n\nAdd to Home Screen\nWhat is this? If you are using Chrome for Android (I’m not sure about iOS), you can make this blog become an app. Just open this blog in Google Chrome (Android), and click option, select “Add to Homescreen”. Now, you have created an app for my blog. Ha! Congrats :)\n\nSubscribe\nLastly, remember to subscribe to my blog’s newsletter through this link: Subscribe Here. \n\nThank you for support me and remember to disable or pause AdBlock while browsing my blog. Thank you and have a nice day.\n",
        "link": "/2015/04/02/The-Story-of-this-website-2.html",
        "date": "2015-04-02 20:00:00 +0800",
        "excerpt": "",
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Notice",
        "content": "We are upgrading our blog.\n\nThis beta version of blog is for development purpose.\n\nThis blog is still under developement. The website might inaccessible without any notice. \n\nHope you enjoy all the bugs and errors in this site.\n\nLastly, no kittens were harmed in the making of this website.\n\n\n    \n\n",
        "link": "/2015/03/28/Notice.html",
        "date": "2015-03-28 20:00:00 +0800",
        "excerpt": "",
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Journey to Yogyakarta - Day 0",
        "content": "It’s time to write something again, as I didn’t write anything for nearly one month. Now it’s time to write something interesting.\n\nDay 0, The story before the journey\n\nHello Borobudur,\nHello Volcano,\nHello Yogyakarta,\nHello Indonesia,\nHello World. \n\nLast week, I travelled to Yogyakarta, Indonesia. \n\nYogyakarta is also known as Jogja. The journey from Singapore /Johor Bahru to Yogyakarta by flight takes around 2 hours. Air Asia offers direct flight from Johor Bahru (JHB) to Yogyakarta (JOG).\n\nAnyway, it is Yogyakarta, not Jakarta. So, is there anything special in Yogyakarta? Yes, Borobudur, Gunung Merapi (Volcano!) are located around Yogyakarta. And you also can see that volcano just from the Yogyakarta city! It sounds awesome right?  \n\nWhy Yogyakarta?\nThe reason I went to Yogyakarta was because I got a free ticket from Airasia (AirAsiaGo.com actually, which gives away a free flight ticket when you book a hotel through its website). It (THE ACCOMMODATION OR ACCOMMODATION + FLIGHT TICKETS?) costs around 800 Ringgit Malaysia for 3 people with a Triple/Double Room for 6 nights. Yes, it’s very very cheap so it’s time to fly again.\n\nLanding failed?!\nWhat? Yes, they (THEY - PLURAL, SHOULD BE PILOTS IN THIS CASE) (pilot, not me) failed to land the Airbus 320-200 on Yogyakarta Airport. \nSo? What happened next? I will talk about it on the next post and it’s coming soon :)\n\n",
        "link": "/2015/03/01/Day0-Journey-to-Yogyakarta.html",
        "date": "2015-03-01 20:00:00 +0800",
        "excerpt": "",
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "The Story of This Website #1",
        "content": "It’s time to write something again.\n\nToday, I have nothing special and important to write. But, I am excited to announce that the domain (URL) of this website is moved to limhenry.me. Shorter URL, so it’s easier to remember!\n\nAnyway, you still can visit limhenry.github.io but it will redirect automatically to limhenry.me\n\nJust ‘upgrade’ the domain, all posts still remain same, don’t worry.\n\nBy the way, I am going to write a very special review (story, something like that) and post it maybe tomorrow (evening, hopefully).\n\nStay tuned and remember to subscribe to my newsletter\n\nAgain, feel free to visit limhenry.me. And wish you Happy Chinese New Year, Huat Ah! (is that too early?)\n\n*PS: sometime, can you disable your AdBlock when you visit this blog? Haha :)\n\n",
        "link": "/2015/02/11/The-Story-Of-This-Website-1.html",
        "date": "2015-02-11 23:30:00 +0800",
        "excerpt": "",
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "My Favorite Android Apps",
        "content": "I am using Android phone right now, because it is nice and good. But not just the hardware make my Android phone nice but apps.\n\nToday I am going to introduce some of my favorite apps.\n\nGoogle Now Launcher\n\nGoogle Now Launcher is developed by Google. It is useful if you are Google Now daily user (hourly?) because this launcher allows user to ‘swipe right to Google Now’. This allows me to access to Google Now even faster than ‘swipe up to Google Now’. This is definitely my favorite launcher. It’s fast and beautiful. \n\nBy the way,the latest version of Google Now Launcher have the Material Design (but no that awesome animation) for Android 4.1 - Android 4.4. Of course, Android 5.0/5.1 will include that animation (ripple effect).\n\nWhy I am not using other launcher like Nova, Apex or stock (default) launcher? This Google Now Launcher is the only launcher makes my phone looks like stock Android. I prefer clean design, and Google Now Launcher is what I need.\n\nGoogle Now Launcher  (Playboard) | Google Now Launcher (Play Store)\n\n\n\n\nOfficeSuite 8\n\nThis app is like a mobile version of Microsoft Office but it for Android phone/tablet. It has almost all the features you need. You can do almost everything in Office Suite 8. You can create and view .docx, .xlsx., .pptx, etc. files with this app. You also can insert image into your document file (this is impossible to do it in Google Docs. \n\nActually, I using the Office Suite Pro 8 right now, so I can access to all their awesome features. Anyway, I didn’t brought it (not pirated, thanks) but I get it for FREE from Amazon App Store (sorry, that promotion ended long long time ago). \n\nAnyway, no matter it’s free version of paid (pro) version, it’s still a powerful app. Er, of course, the paid version is still the best. Yes, it’s better than Google Docs/Slide/Sheet. \n\nOfficeSuite 8 + PDF Converter  (Playboard) | OfficeSuite 8 + PDF Converter (Play Store)\n\n\nOfficeSuite 8 Pro + PDF  (Playboard) | OfficeSuite 8 Pro + PDF (Play Store)\n\n\n\n\nHeads-up notifications\n\nYou need this app if you are not running Android 5.0 (Lollipop users, you got this feature already, shh, don’t show off/hao-lian).\n\nGoogle introduced the new Notification design for Android 5.0, Lollipop. It’s nice and make your notification more visible, accessible, and configurable.\n\nUnfortunately, that’s only exclusive for Lollipop. Thanks to Heads-up notifications, those STILL using Android 4.4 and below will also have the ability to enjoy this beautiful pop-up (heads-up) notification. \n\nThis app is highly customizable so you can choose which app to show in heads-up notification or when the notification will not show.\n\nNote: Heads-up Notification is open source and available in GitHub\n\nHeads-up notifications  (Playboard) | Heads-up notifications (Play Store)\n\n\n\n\nOkay, three apps should enough for today. I will talk some other apps next time (Part 2 is coming soon, haha). Anyway, remember to SUBSCRIBE to my newsletter in order to get the latest alert/notification when new post in updated. \n\nAny questions/comments? You are welcome to comment at the Discussion area below. \n\nBye bye and have a nice day. \n* Chinese New Year is coming ^^\n\n",
        "link": "/2015/02/08/My-Favorite-Android-Apps-Part1.html",
        "date": "2015-02-08 20:00:00 +0800",
        "excerpt": "",
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "[UPDATE, IT’S REAL] Android 5.1",
        "content": "Few hours ago, Google updated their site for Android One in Indonesia with Android 5.1. \n\nAnd now, it’s real and confirmed. Android 5.1 is now running on Evercoss One X, Mito Impact and Nexian Journey. And it will also available to update for Nexus 5,6 and 9 very very soon.\n\nHere is some images from AndroidPolice.com\n\n\n    \n\n\n    \n\n\n    \n\n\nWe mentioned this few hours ago:\n\n\n  Android One is coming to Indonesia very very soon and the phone will running the ‘latest’ version of Android 5.1. What? 5.1??? YES, 5.1 not 5.01!\n\n\n\n  \n    \n\n\n&lt;/div&gt;\n\n\n  Android 5.1\n  The sweetest version of Android, 5.0 Lollipop is announced during Google I/O 2014. And now Google ‘introduce’ the new Android 5.1 indirectly but it sound legit.\n\n\n\n  Source : Android.com\n\n\n",
        "link": "/2015/02/05/Android-5.1.html",
        "date": "2015-02-05 02:00:00 +0800",
        "excerpt": "",
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Windows 10 Review",
        "content": "Microsoft announced the latest build of Windows 10 Technical Preview Build 9926 on 23 January 2015.\n\nWindows 10. Pricing? Free, seriously. Windows 10 will be available to be upgraded for every Windows 7, 8 and 8.1 users. FREE. No hidden charge. Just you are not running a pirated version of Windows, LOL.\n\nSo, are there any new things/features in this latest build of Windows 10?\n\nHey Cortana.\nFirst, CORTANA. People love technology. People love artificial intelligence (AI). There are Siri for iOS users, Google Now for Android (and iOS, oops) and Cortana for Windows phone. \n\nNow, the biggest problem is: computer should be smarter than smartphone, every features in smartphone should also be available in computer. So, Microsoft introduces Cortana, a Microsoft AI for Windows 10.\n\nIs that awesome? Currently, no. Maybe it’s still under development/beta. Anyway, how is the quality/performance/feature of Cortana in this latest build of Windows 10? \n\nThe available features are still very limited. You only can set reminders, check weather forcast, and I think that’s all. You can’t ask her (Cortana is a female…) “who is Obama?”. If you ask her, she will simply redirect you to Bing.com (Where is my Google?)\n\nSo, Cortana in Windows 10, let’s ignore this feature until the next build or the final release of Windows. Hope Cortana will become a better and awesome future.\n\nHello Start Menu.\nNext, Start Menu is back! But don’t be so happy. The ‘new’ start menu is something like the combination of the start menu of Windows 7 and metro start of Windows 8. It looks weird and I don’t like it. I still prefer Windows 8 metro start or Windows 7 start menu. Just don’t combine together. Anyway, it should work better in touch screen mode.\n\nVirtual Desktop\nVirtual Desktop. This is one of the features in Mac OS long long time ago. And finally it will be available in Windows (without any third-party add-ons). It works quite nicely but it’s a little bit unfamiliar to Windows users. It’s still a nice feature anyway.\n\nA Windows PC for just only USD 35?\nWait wait. Did Microsoft say Windows 10 is an OS for any devices from no screen to phone, tablet, laptop, PC, even TV? Yes. Windows 10 is bigger and stronger than you think.\n\nA Windows PC for just 35USD? Seriously, Windows JUST announced that Windows 10 will also be available for Raspberry Pi 2 for free. Our next generation, 35USD computer is coming soon. More info: raspberrypi.org\n\nWindows 10 is nice. But I will continue using my beautiful and fast Ubuntu i mentioned few days ago. Link\n\nThanks for reading my blog and supporting me, have a nice day.\n\n\n    \n\n\n    \n\n\n    \n\n\n    \n\n\n    \n\n\n    \n\n\n",
        "link": "/2015/02/04/Windows-10-Review.html",
        "date": "2015-02-04 20:00:00 +0800",
        "excerpt": "",
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Xperia M2 Review",
        "content": "Sony Xperia M2, the phone I am using right now.\n\nSony introduced this mid-range phone, Xperia M2 in CES 2014 and released in Q2 ‘14.\n\nThe price range is around USD300 (it’s around MYR 799 due today).\n\nIt’s not cheap, and I strongly NOT RECOMMENDING you if you wanna to buy a new Android phone.\n\nWhy? It’s that not good? No, it’s nice, but please don’t buy an old phone.\n\nAnyway, let’s talk about this phone. Design, it’s nice. It has the (nearly) same design with Sony flagship devices like Z3, Z2 and Z1. But it is not using glass but plastic. That plastic is like a fingerprint-magnet, just holding that phone for a few seconds without cover, the back of phone will be full of fingerprint. So, a phone cover is highly recommended if you are using Xperia M2 right now.\n\nPerformance, it’s like a normal mid-range Android smartphone, it’s not so slow, normal browsing, Facebook, all no problem. Games? It still can run “Asphalt 8: Airborne” without any lag (the loading speed might be a bit bit longer ( ͡° ͜ʖ ͡°) ).\n\nCamera. Firmware problem and it’s solved. Xperia M2 released to public with Android 4.3, Jelly Bean. During that time, the quality of camera is a bit horrible, especially the image noise. Luckily the problem solved after the Kitkat update. By the way, it’s running with a 8MP camera, with Full HD support. \n\nFront camera of Xperia M2? I just ignore that camera. The front camera is ‘unusable’. A VGA-front camera, that’s is totally horrible. If you are a selfie-lover, just simply don’t buy this phone. Brought already, use the rear camera. Thanks to the Camera button, you still can take selfie with that rear-camera, just need a little practise and skill.\n\nSpeaker. It’s quite loud, thanks to Sony’s xLOUD technology and ClearPhase. You can enjoy a ‘not bad’ quality with Xperia M2. \n\nBUT….  my phone having the biggest problem in this world (it look like I am the only one having this problem), which is the sound output (speaker and earphone, but no problem with Bluetooth earphone/speaker). The sound will stop playing randomly for 5 seconds -1 minute when the screen is off. I have no way to solve it, even after asking in XDA and Sony Support.\n\nConclusion: DON’T BUY.it’s not so cheap anyway. Buy Nexus 5 instead. Nexus 5 is a great phone but costs you around MYR 1200. Want cheaper, buy Moto G (second gen if possible)\n\nNote: there is still no news about Android 5.0, Lollipop official update for Xperia M2. Sad news T.T\n\n\n    \n    \n\n\n",
        "link": "/2015/02/03/Sony-Xperia-M2-Review.html",
        "date": "2015-02-03 20:00:00 +0800",
        "excerpt": "",
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Google Glass, Hands On and a very quick review",
        "content": "Google Glass, Google Glass, Google Glass, Google Glass, Google Glass, Google Glass, Google Glass, Google Glass…\n\nIt became my favourite tech gadget the moment it announced to public.\n\nAnyway, I managed to borrow that awesome Google Glass from Yap Wen Jiun. \n\nGoogle Glass is awesome, it’s light and it’s amazing.\n\nYou probably know how it works and how it look like. But it is hard to know the feeling when you are wearing it.\n\nSo, I got the chance to borrow it after the MMU Android Meetup in 31 October 2014. I was so excited when that Google Glass is really in front of me. I took out my glasses, and put the Google Glass on my face. Something happens! I saw a blur screen in front of me. Kay, I immediately knew the reason and finally, I ‘force’ to wear double glasses (my perspective glasses + Google Glass).\n\nDouble glasses on my face. It’s weird. But whatever, just ignore it.\n\nThe speaker of Google Glass. It’s awesome. It uses the Bone Conduction Transducer (BCT), so the sound is pretty amazing, it’s loud and crystal clear. Microphone? Awesome. I was using that Google Glass in a hall (quite noisy there), but Google Glass was still listening to what I am talking about.\n\nScreen? Amazing. The HUD makes you like Iron Man, a small rectangle screen floating in front of you (it is around 2-3m in front of you). And it’s ‘floating’. That is quite a weird experience. And it’s also looks semi-transparent, so the screen will not bother you. \n\nOk Glass, take a picture. Ok Glass, record a video. Ok Glass, Google, what is Google Glass? I was so busy with trying that piece of technology. That is the real technology. The future is here. \n\nGoogle Glass is expensive. It costs you USD1500 or it’s around MYR5000. IT IS VERY VERY EXPENSIVE! I am just waiting for one day (and I believe it’s coming), a cheaper version of Google Glass is going to release to the consumer, or maybe less than USD300? \n\nIt’s coming soon to us because “Google Glass is graduating from Google[x] labs” . I hope Google Glass Consumer Edition will announce during Google I/O this year, maybe?\n\nHello Glass, Hello Google, Hello World.\n\n\n    \n\n\n    \n\n\n    \n\n\n    \n\n\n",
        "link": "/2015/01/31/Google-Glass-Hands-On-And-Review.html",
        "date": "2015-01-31 22:20:00 +0800",
        "excerpt": "",
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Quick review of my PC (Ubuntu)",
        "content": "A quick review of my PC with Ubuntu\n\nI am using ASUS X550LD right now, overall it is OK. This computer is pre-installed with Windows 8.1 but…… (Most of the time) I am using Ubuntu 14.04.1. \n\nWhy? Is Ubuntu better than Windows?\n\nThe answer is yes and no. I can’t afford to buy a MacBook, so I ‘force’ to buy a Windows PC. And now, I installed this Ubuntu to my lappy. Firstly, it runs sucks because the graphic card (NVIDIA Geforce 820M) can’t detect, until one day (I also dunno the reason) my Ubuntu detected that graphic card without any reason. \n\nOk, now graphic card is detected, it is time to say goodbye to Windows. \n\nFor me, Ubuntu is an OS like Mac OS, but you “can’t run Photoshop”. It’s fast, just I hate that default design. Thanks to Hii, he introduced and taught me something very awesome which is called “Gnome”. It’s awesome and beautiful. Somehow I love Material Design so much, so I decided to make my Ubuntu more material design. In conclusion, it’s very very nice!\n\nPerformance? Yes, it is better than Windows. For example, it’s easier to run Jekyll in Ubuntu compare to Windows. Another example is: Android Studio.\n\nLast time, I didn’t know Ubuntu is so fast, then I using Windows to develop and build some Android app. It’s suck, slow and you will see “Not Responding” almost everyday (every hour, maybe?). The compile app duration in Windows is around 3-4 minutes (in my case), but when I compile in Ubuntu, it only took 30-40 seconds. Seriously? Yep, Ubuntu is amazing.\n\nOne thing (two actually), make my Ubuntu a bit ‘haiz’ are speaker and touchpad. Due to kernel/driver problem, that touchpad doesn’t work with my laptop, luckily I got mouse. Next, speaker. The sound in Ubuntu is really very ‘unlistenable’. Luckily I got Pulse Audio Equalizer, which make my laptop’s speaker better a little bit, but not so nice. \n\nHow about the Microsoft latest OS, Windows 10, which is still under technical preview, it’s still very buggy. For me, Windows 7, 8, 8.1 and 10 are same. But what I need is a fast OS, so Hello Ubuntu, Hello Linux, Hello World.\n\nI will talk about my opinion and hand-on with Windows 10 Technical Preview in next post. Thanks for reading my post, have a nice day. ^^\n\nScereenshot:\n\n\n    \n\n\n    \n\n\n    \n\n\n    \n\n\n    \n\n\n    \n\n\n    \n\n",
        "link": "/2015/01/31/Quick-review-of-My-PC.html",
        "date": "2015-01-31 05:15:00 +0800",
        "excerpt": "",
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "My First Post",
        "content": "Hello World.\n\nI am Henry Lim.\n\nI am a student, a developer and a human of course.\n\nThis is my first blog and it’s hosted on GitHub. Anyway, this awesome blog is built by using Jekyll. It’s quite simple to build a blog like this. In the meantime, this blog is still under development and the blog (layout) will be updated from time to time.\n\nSometimes, you might ask me, why don’t I use blogger or wordpress? In Blogger/WordPress, you just write your post, and you can straight away post it.\n\nBut in GitHub, you need to create a blog by yourself (thanks to Jekyll, that saved my life…). Then, you can change the layout by using CSS without any limitation (which is nearly impossible in Blogger/WordPress), and I had a very lousy reason to learn HTML/CSS ( ͡° ͜ʖ ͡°), LOL.\n\nI love web, so I love HTML. Of course, I only love a beautiful website, maybe Material Design?\n\nSince this blog is still under development, it’s time to let me continue to make this website better and nicer,\n\nThank you for reading my first post on this website.\n\nBy the way, remember to visit my home page : limhenry.github.io\n\nHave a nice day ^^\n\n",
        "link": "/2015/01/31/My-First-Post.html",
        "date": "2015-01-31 02:17:00 +0800",
        "excerpt": "",
        "seach_omit": ""
    }
    
    



    

    
    ,{
        "title": "Search",
        "content": "\n\n\n\n\n\n\n  \n  \n    Search term\n    \n    \n  \n  \n\n\n\n  \n  \n  \n     result(s) found for &ldquo;&rdquo;.\n  \n  \n\n\n\n\n\n  \n\n  \n\n\n\n  \n  \n\n  \n  \n",
        "link": "/search/",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Home",
        "content": "\n\t{% include adsense.html %} \n\t{% for post in site.posts %}\n\t\n\t\n\t\n\t\t\n\t\t\t\n\t\t\t\t{{ post.title }}\n\t\t\t\t{{post.date | date: \"%-d %-B %Y\" }} •  posted by Henry Lim\n\t\t\t\t{{ post.excerpt }}\n\t\t\t\tRead More\n\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\n\t\n\t\t\n\t\n\t{% endfor %}\n\t{% include adsense.html %} \n\t\n\tBlog - Henry Lim\n\thenrylim.everything@gmail.com\n\tThis is the first and only blog for Henry Lim.\n\tI will post some interesting story or some review to this blog. Just keep follow and subscribe to my blog.\n\t\n\n\n\n\n",
        "link": "/",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    

    

]